// В скрипте на стороне клиента
// Получение параметров URL
var params = new URLSearchParams(window.location.search);
var dictionaryParam = params.get('dictionary');

// Десериализация JSON
if (dictionaryParam) {
  var dictionary = JSON.parse(decodeURIComponent(dictionaryParam));
  // Теперь dictionary - это объект JavaScript, который можно использовать как словарь
}


// Перезаписываем словарь с парами слов на английском и русском языках
var dictionary = {
"я":"εγώ",
"ты":"εσύ",
"он":"αυτός (τος)",
"она":"αυτή (τη)",
"оно":"αυτό (το)",
"мы":"εμείς",
"вы":"εσείς",
"они":"αυτοί (τοι), αυτές (τες), αυτά (τα)",
"этот":"αυτός",
"эта":"αυτή",
"это":"αυτό",
"тот":"εκείνος",
"та":"εκείνη",
"то":"εκείνο",
"здесь":"εδώ",
"там":"εκεί",
"кто":"ποιος",
"что":"τι",
"где":"πού",
"когда":"πότε",
"как":"πώς",
"не":"δε(ν), μη(ν)",
"весь, вся, всё":"όλος, όλη, όλο",
"много":"πολλοί",
"несколько":"μερικοί",
"мало, немного":"λίγοι",
"другой, иной":"άλλος",
"один, одно, одна":"ένας, ένα, μια (μία)",
"два":"δύο (δυο)",
"три":"τρία",
"четыре":"τέσσερα",
"пять":"πέντε",
"большой, великий":"μεγάλος",
"длинный, долгий":"μακρύς",
"широкий":"πλατύς, φαρδύς",
"толстый":"παχύς, χοντρός",
"тяжёлый":"βαρύς",
"маленький, малый":"μικρός",
"короткий":"κοντός",
"узкий":"στενός",
"тонкий":"λεπτός",
"женщина":"γυναίκα",
"мужчина":"άνδρας",
"человек":"άνθρωπος",
"ребёнок, дитя":"παιδί",
"жена, супруга":"σύζυγος, γυναίκα",
"муж, супруг":"σύζυγος, άντρας",
"мать":"μητέρα, μάνα",
"отец":"πατέρας",
"зверь, животное":"ζώο",
"рыба":"ψάρι",
"птица":"πουλί",
"собака, пёс":"σκύλος",
"вошь":"ψείρα",
"змея":"φίδι",
"червь, червяк":"σκουλήκι",
"дерево":"δέντρο",
"лес":"δάσος",
"палка":"ραβδί, βέργα",
"плод, фрукт":"φρούτο",
"семя, семена":"σπόρος",
"лист":"φύλλο",
"корень":"ρίζα",
"кора (дерева)":"φλοιός",
"цветок":"λουλούδι",
"трава":"χορτάρι",
"верёвка":"σχοινί",
"кожа, шкура":"δέρμα",
"мясо":"κρέας",
"кровь":"αίμα",
"кость":"κόκαλο",
"жир, сало":"λίπος",
"яйцо":"αυγό (αβγό)",
"рог":"κέρατο",
"хвост":"ουρά",
"перо":"πούπουλο, φτερό",
"волос, волосы":"τρίχα, μαλλιά",
"голова":"κεφάλι",
"ухо":"αυτί, αφτί",
"глаз":"μάτι, οφθαλμός",
"нос":"μύτη",
"рот":"στόμα",
"зуб":"δόντι",
"язык":"γλώσσα",
"ноготь":"νύχι",
"стопа, ступня":"πόδι",
"нога":"πόδι",
"колено":"γόνατο",
"рука":"χέρι",
"крыло":"φτερό",
"живот":"κοιλιά",
"внутренности, кишки":"εντόσθια, σπλάχνο",
"шея":"λαιμός, τράχηλος",
"спина":"πλάτη",
"грудь":"στήθος",
"сердце":"καρδιά",
"печень":"συκώτι",
"пить":"πίνω",
"есть, кушать":"τρώω (τρώγω)",
"грызть, кусать":"δαγκώνω",
"сосать":"απομυζώ, εκμυζώ",
"плевать":"φτύνω",
"блевать, рвать":"ξερνώ",
"дуть":"φυσάω",
"дышать":"αναπνέω, ανασαίνω",
"смеяться":"γελάω/γελώ, ανασαίνω",
"видеть":"βλέπω",
"слышать":"ακούω",
"знать, ведать":"ξέρω, γνωρίζω",
"думать, мыслить":"σκέφτομαι, νομίζω",
"нюхать, чуять":"μυρίζω",
"бояться, страшиться":"φοβάμαι",
"спать":"κοιμάμαι",
"жить":"ζω",
"умирать":"πεθαίνω",
"убивать":"σκοτώνω",
"бороться":"μάχομαι",
"ловить, охотиться":"κυνηγώ",
"бить, ударять":"κυνηγώ",
"резать, рубить, сечь":"κόβω",
"разделить":"χωρίζω",
"колоть, кольнуть":"μαχαιρώνω",
"царапать, скрести, чесать":"ξύνω",
"копать, рыть":"σκάβω",
"плавать":"κολυμπώ",
"летать":"πετάω",
"ходить, идти":"περπατώ",
"приходить, прийти":"έρχομαι",
"лежать":"ξαπλώνω, οριζοντιώνομαι",
"сидеть":"κάθομαι",
"стоять":"στέκομαι",
"вращать, вертеть":"γυρίζω",
"падать":"πέφτω",
"давать":"δίνω",
"держать":"κρατάω",
"сжимать, стискивать":"ζουλάω",
"тереть":"τρίβω",
"мыть, умывать":"πλένω",
"вытирать":"σκουπίζω",
"тянуть, тащить":"τραβώ",
"толкать, пихать":"σπρώχνω",
"бросать, кидать":"ρίχνω, πετώ",
"связывать":"δένω",
"шить":"ράβω",
"считать":"μετράω/μετρώ",
"говорить, сказать":"λέω",
"петь":"τραγουδώ",
"играть":"παίζω",
"плыть":"πλέω, επιπλέω",
"течь":"τρέχω",
"замерзать":"παγώνω",
"пухнуть":"φουσκώνω, πρήζομαι",
"солнце":"ήλιος",
"луна, месяц":"φεγγάρι, σελήνη",
"звезда":"αστέρι, άστρο",
"вода":"νερό",
"дождь":"βροχή",
"река":"ποτάμι",
"озеро":"λίμνη",
"море":"θάλασσα",
"соль":"αλάτι",
"камень":"πέτρα",
"песок":"άμμος",
"пыль":"σκόνη",
"земля":"γη",
"туча, облако":"σύννεφο, νέφος",
"туман":"ομίχλη",
"небо":"ουρανός",
"ветер":"αέρας",
"снег":"χιόνι",
"лёд":"πάγος",
"дым":"καπνός",
"огонь":"φωτιά",
"зола, пепел":"στάχτη",
"жечь, гореть":"καίω",
"дорога, путь":"δρόμος",
"гора":"βουνό",
"красный":"κόκκινος",
"зелёный":"πράσινος",
"жёлтый":"κίτρινος",
"белый":"άσπρος, λευκός",
"чёрный":"μαύρος",
"ночь":"νύχτα",
"день":"μέρα/ημέρα",
"год":"χρόνος",
"тёплый":"ζεστός",
"холодный":"κρύος",
"полный":"γεμάτος",
"новый":"καινούργιος, νέος",
"старый":"παλιός",
"хороший":"καλός",
"плохой":"κακός",
"гнилой":"σάπιος",
"грязный":"βρόμικος",
"прямой":"ίσιος",
"круглый":"στρογγυλός",
"острый":"κοφτερός",
"тупой":"στομωμένος",
"гладкий, ровный":"λείος",
"мокрый":"βρεγμένος, υγρός",
"сухой":"στεγνός, ξερός",
"правильный":"σωστός",
"близкий":"κοντά",
"далёкий, дальний":"μακριά",
"правый":"δεξιά",
"левый":"αριστερός",
"при, у, возле":"σε",
"в, внутри":"μέσα",
"с, со":"με",
"и":"και",
"если":"εάν, αν",
"потому что":"επειδή, γιατί",
"имя":"όνομα"
};

// Создаем массив из ключей словаря 
var keys = Object.keys(dictionary);

// Создаем переменные для хранения счета, времени и статуса игры
var score = 0;
var time = 60;
var game_over = false;

// Создаем переменную для хранения выбранного слова
var selected_word = null;

// Создаем функцию для генерации случайного числа в заданном диапазоне
function random(min, max) {
  return Math.floor(Math.random() * (max - min + 1)) + min;
}

// Создаем функцию для запуска игры
var english_words = [];
var russian_words = [];
// var total_words = 0; // Добавляем переменную для общего счета слов

function start() {
  $("#english").empty();
  $("#greek").empty();

  // Скрываем элемент для конца игры
  $("#game-over").hide();
  
  // Генерируем новые слова, если массивы пусты
  if (english_words.length === 0) {
    generateWords();
  }

  // Устанавливаем время
  var time = 60;

  var timer = setInterval(function () {
    time--;
    $("#time").text("Time: " + time);

  // Проверяем, остались ли на странице контейнеры с классом "word"
  var wordContainers = $(".word");
  if (wordContainers.length === 0) {
    // Если контейнеров нет, генерируем новые слова
    generateWords();
  }

    if (time === 0) {
      clearInterval(timer);
      game_over = true;
      $("#game-over").show();

      // Выводим общий счет игрока
      $("#game-over2").text("Total Score: " + score);
    }
  }, 1000);
}

// Создаем функцию для проверки совпадения слов
function check_match(word1, word2) {
  // Если слова являются переводами друг друга
  if (dictionary[word1] == word2 || dictionary[word2] == word1) {
    // Увеличиваем счет на один
    score++;
    // Обновляем текст элемента для счета
    $("#score").text("Score: " + score);
    // Возвращаем true
    return true;
  } else {
    // Возвращаем false
    return false;
  }
}

// Создаем функцию для обработки нажатия на слово
function on_word_click(event) {
  // Если игра не закончена
  if (!game_over) {
    // Получаем элемент, на который нажали
    var element = $(event.target);
    // Получаем текст элемента
    var word = element.text();
    // Если выбрано другое слово
    if (selected_word) {
      // Проверяем совпадение слов
      var match = check_match(selected_word, word);
      // Если слова совпадают
      if (match) {
        // Удаляем элементы для слов
        element.remove();
        $(".selected").remove();
	// Добавляем слово к общему счету
	// total_words++;
      } else {
        // Снимаем выделение с элементов
        element.removeClass("selected");
        $(".selected").removeClass("selected");
      }
      // Очищаем переменную для выбранного слова
      selected_word = null;
    } else {
      // Запоминаем выбранное слово
      selected_word = word;
      // Выделяем элемент
      element.addClass("selected");
    }
  }
}

function generateWords() {

  // Перезапускаем массив из ключей словаря 
  var keys = Object.keys(dictionary);
  
  // Генерируем новые слова
  english_words = [];
  russian_words = [];
  word_count = 4

  for (var i = 0; i < word_count; i++) {
    var index = random(0, keys.length - 1);
    var word = keys[index];
    english_words.push(word);
    keys.splice(index, 1);

  }
  for (var i = 0; i < word_count; i++) {
    var word = dictionary[english_words[i]];
    russian_words.push(word);
  }
  russian_words.sort(function () {
    return 0.5 - Math.random();
  });

  // Отображаем английские слова
  for (var i = 0; i < word_count; i++) {
    var word = english_words[i];
    var element = $("<button></button>").addClass("word").text(word);
    $("#english").append(element);
  }

  // Отображаем русские слова
  for (var i = 0; i < word_count; i++) {
    var word = russian_words[i];
    var element = $("<button></button>").addClass("word").text(word);
    $("#greek").append(element);
  }
}




// При загрузке документа
$(document).ready(function() {
  // Привязываем функцию к событию нажатия на слово
  $("#words").on("click", ".word", on_word_click);
  // Запускаем игру
  start();
});
